# 在Python中，注释用井号（# ）标识。井号后面的内容都会被Python解释器忽略

# 编写注释的主要目的是阐述代码要做什么，以及是如何做的。在开发项目期间，你对各
# 个部分如何协同工作了如指掌，但过段时间后，有些细节你可能不记得了。当然，你总
# 是可以通过研究代码来确定各个部分的工作原理，但通过编写注释以清晰的自然语言对
# 解决方案进行概述，可节省很多时间。

'''要成为专业程序员或与其他程序员合作，就必须编写有意义的注释。当前，大多数软件
是合作编写的，编写者可能是同一家公司的多名员工，也可能是众多致力于同一个开源
项目的人员。训练有素的程序员都希望代码中包含注释，因此你最好从现在开始就在程
序中添加描述性注释。作为新手，最值得养成的习惯之一就是在代码中编写清晰、简洁
的注释。'''

如果不确定是否要编写注释，就问问自己：在找到合理的解决方案之前，考虑了多个解
决方案吗？如果答案是肯定的，就编写注释对你的解决方案进行说明吧。相比回过头去
再添加注释，删除多余的注释要容易得多。从现在开始，本书的示例都将使用注释来阐
述代码的工作原理。


# ctrl+/ 多行注释  shift+# 单行注释  
'''先后三个单引号或双引号 将要注释的插在中间 '''
""" 双引号必须双引号结束 单引号必须单引号结束 否则后边全注释掉了 """


